Yourcomputermaster/src/InformationRegisters/ВКМ_ГрафикРабот/ВКМ_ГрафикРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикРабот</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикРабот</name>
    <type>
      <types>EnumRef.ВКМ_ГрафикРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Yourcomputermaster/src/InformationRegisters/ВКМ_ГрафикРабот/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции
Функция ФормированиеКоличестваДней(ПериодНачало, ПериодКонец) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(ВКМ_ГрафикРабот.Значение / 8, 0)) КАК КоличествоДней
	               |ИЗ
	               |	РегистрСведений.ВКМ_ГрафикРабот КАК ВКМ_ГрафикРабот
	               |ГДЕ
	               |	ВКМ_ГрафикРабот.Дата МЕЖДУ &ПериодНачало И &ПериодКонец";
	Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
	Запрос.УстановитьПараметр("ПериодКонец", ПериодКонец);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.КоличествоДней;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("На данный период не установлен график работ",,,, Истина);
		Возврат 0;
	КонецЕсли;
	
КонецФункции
#КонецОбласти

#КонецЕсли
